src/Catalogs/Цели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Цели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДостижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСИнфляцией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелёк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Цели/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПостановки) Тогда
		Объект.ДатаПостановки = ТекущаяДата();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаДостижения) Тогда
		Объект.ДатаДостижения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПостановкиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПостановки) Тогда
		Объект.ДатаПостановки = ТекущаяДата();
	КонецЕсли;
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДостиженияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаДостижения) ИЛИ Объект.ДатаДостижения < Объект.ДатаПостановки Тогда
		Объект.ДатаДостижения = ТекущаяДата();
	КонецЕсли;
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	КолВоДней = (Объект.ДатаДостижения - Объект.ДатаПостановки)/86400;
	Объект.СуммаСИнфляцией = Объект.Сумма * pow((1+0.03/365),КолВоДней);
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры
&НаКлиенте
Процедура РассчитатьСуммуСИнфляцией()
	
	КолВоДней = (Объект.ДатаДостижения - Объект.ДатаПостановки)/86400;
	Объект.СуммаСИнфляцией = Объект.Сумма * pow((1+0.03/365),КолВоДней);
	
КонецПроцедуры
